In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
data = pd.read_csv('points-of-sale-transactions-mar-22.csv')

In [3]:
data

     112    Main  Unnamed: 2 Unnamed: 3  Unnamed: 4  Unnamed: 5
0      5  $B$456         NaN    Refresh           0         NaN
1      5  $B$458         NaN    Refresh           0         NaN
2      5  $B$457         NaN    Refresh           0         NaN
3    7-3  $BE$49         NaN    Refresh           0         0.0
4    7-3  $BE$46         NaN    Refresh           0         0.0
..   ...     ...         ...        ...         ...         ...
107  7-3   $K$24         NaN    Refresh           0         0.0
108  7-3   $C$19         NaN    Refresh           0         0.0
109  7-3   $C$16         NaN    Refresh           0         0.0
110  7-3   $C$31         NaN    Refresh           0         0.0
111  7-3  $BE$15         NaN    Refresh           0         0.0

[112 rows x 6 columns]

In [4]:
missing_data = data.isnull()
missing_data.head(5)

     112   Main  Unnamed: 2  Unnamed: 3  Unnamed: 4  Unnamed: 5
0  False  False        True       False       False        True
1  False  False        True       False       False        True
2  False  False        True       False       False        True
3  False  False        True       False       False       False
4  False  False        True       False       False       False

In [5]:
for column in missing_data.columns.values.tolist():
    print(column)
    print (missing_data[column].value_counts())
    print("")

112
False    112
Name: 112, dtype: int64

Main
False    112
Name: Main, dtype: int64

Unnamed: 2
True    112
Name: Unnamed: 2, dtype: int64

Unnamed: 3
False    112
Name: Unnamed: 3, dtype: int64

Unnamed: 4
False    112
Name: Unnamed: 4, dtype: int64

Unnamed: 5
False    109
True       3
Name: Unnamed: 5, dtype: int64

In [7]:
avg_Weekly_Sales = data["Unnamed: 2"].astype("float").mean(axis=0)
print("Average of Unnamed: 2", avg_Weekly_Sales)

Average of Unnamed: 2 nan

In [8]:
avg_Weekly_Sales=data['Unnamed: 2'].astype('float').mean(axis=0)
print("Average of Unemployment:", avg_Weekly_Sales)
# replace NaN by mean value in "Weekly_Sales" column
data["Unnamed: 2"].replace(np.nan, avg_Weekly_Sales, inplace = True)

Average of Unemployment: nan

In [17]:
data['Unnamed: 5'].value_counts()

0.0    109
Name: Unnamed: 5, dtype: int64

In [13]:
# simply drop whole row with NaN in "CPI" column
data.dropna(subset=["Unnamed: 4"], axis=0, inplace=True)

# reset index, because we droped two rows
data.reset_index(drop=True, inplace=True)
data.head()

   112    Main  Unnamed: 2 Unnamed: 3  Unnamed: 4  Unnamed: 5
0    5  $B$456         NaN    Refresh           0         NaN
1    5  $B$458         NaN    Refresh           0         NaN
2    5  $B$457         NaN    Refresh           0         NaN
3  7-3  $BE$49         NaN    Refresh           0         0.0
4  7-3  $BE$46         NaN    Refresh           0         0.0

In [14]:
data.dtypes

112            object
Main           object
Unnamed: 2    float64
Unnamed: 3     object
Unnamed: 4      int64
Unnamed: 5    float64
dtype: object

In [36]:
data.head()

   112    Main  Unnamed: 2  Unnamed: 3  Unnamed: 4  Unnamed: 5
0    5  $B$456         NaN         0.0           0         NaN
1    5  $B$458         NaN         0.0           0         NaN
2    5  $B$457         NaN         0.0           0         NaN
3  7-3  $BE$49         NaN         0.0           0         0.0
4  7-3  $BE$46         NaN         0.0           0         0.0

In [37]:
for column in missing_data.columns.values.tolist():
    print(column)
    print (missing_data[column].value_counts())
    print("")

112
False    112
Name: 112, dtype: int64

Main
False    112
Name: Main, dtype: int64

Unnamed: 2
True    112
Name: Unnamed: 2, dtype: int64

Unnamed: 3
False    112
Name: Unnamed: 3, dtype: int64

Unnamed: 4
False    112
Name: Unnamed: 4, dtype: int64

Unnamed: 5
False    109
True       3
Name: Unnamed: 5, dtype: int64